import Foundation

//В Playground реализуйте некоторый базовый класс из выбранной вами области описания (тематики).
//Добавьте в него свойства и методы, а также несколько инициализаторов. Класс должен содержать свойства и методы разной области видимости (private, fileprivate, internal или public)
//Создайте несколько классов-наследников. Переопределите при необходимости свойства и методы родителя. А также добавьте свои.
//В основном пространстве Playground создайте функцию для демонстрации полиморфизма.


